## 1) qty의 평균
## 2) price가 1000 이상인 과일 이름 출력
## 3) cherry, banana, mango, apple 순 출력
## 4) 세 번째 row에 추가 peach 추가 (price : 2500, qty : 3)
## 5) qty -> QTY 수정

In [8]:
import numpy as np
import pandas as pd

fruits = pd.DataFrame({'name':['apple','mango','banana','cherry'],

                    'price':[2000,150,500,400],

                    'qty':[5,4,10, np.NaN]})
fruits

     name  price   qty
0   apple   2000   5.0
1   mango    150   4.0
2  banana    500  10.0
3  cherry    400   NaN

1번

In [12]:
# 1)
fruits['qty'].mean(axis=0)

6.333333333333333

2번

In [34]:
# 2) price가 1000이상인 과일 이름 출력
result = fruits['price']>=1000
fruits[result]['name']

0    apple
Name: name, dtype: object

In [52]:
# GPT 답변
result = fruits.loc[fruits['price'] >= 1000, 'name']
result

0    apple
Name: name, dtype: object

In [53]:
fruits.loc[0,'name'] #인것 처럼.출력되는것 같다.

'apple'

In [54]:
result = fruits['price']>=1000
result2 = fruits.loc[result,'name']
result2

0    apple
Name: name, dtype: object

3번 cherry, banana, mango, apple 순 출력

#교수님이 한대로 name을 index로 바꾸고 처음부터 해보겠다.
1번.

In [9]:
# 교수님이 한대로 name을 index로 바꾸고 처음부터 해보겠다.
import numpy as np
import pandas as pd

fruits = pd.DataFrame({'name':['apple','mango','banana','cherry'],

                    'price':[2000,150,500,400],

                    'qty':[5,4,10, np.NaN]})

fruits.index = fruits['name']
fruits
# 중복 생성되도 버리면 되서 그런가. 그럼 내가 버려보자.

          name  price   qty
name
apple    apple   2000   5.0
mango    mango    150   4.0
banana  banana    500  10.0
cherry  cherry    400   NaN

In [10]:
fruits.drop(['name'],axis=1,inplace=True)
fruits
# 이거 할 필요없음 그냥 fruits = fruits.set_index('name') 하면 됨 ㅠㅜ

        price   qty
name
apple    2000   5.0
mango     150   4.0
banana    500  10.0
cherry    400   NaN

In [11]:
# 2번
fruits[fruits['price']>=1000]

       price  qty
name
apple   2000  5.0

In [12]:
fruits.loc[fruits['price']>=1000]

       price  qty
name
apple   2000  5.0

3. 3번 cherry, banana, mango, apple 순 출력

In [13]:
fruits.loc[['cherry','banana','mango','apple']]
# 교수님 답변
#fruits2 = fruits.reindex(['cherry', 'banana', 'mango', 'apple'])
#fruits2

        price   qty
name
cherry    400   NaN
banana    500  10.0
mango     150   4.0
apple    2000   5.0

# Rows 출력은 loc!
columns출력은 그냥 fruits['price']

4. ) 세 번째 row에 추가 peach 추가 (price : 2500, qty : 3)

In [14]:
# 일단 값 넣고 reindex하면 될거같은데
# reindex 하고 값넣어도됨.
fruits2 = fruits.reindex(['apple','mango','banana','peach','cherry'])
fruits2.loc['peach'] = {'price':2500,'qty':3}
fruits2

         price   qty
name
apple   2000.0   5.0
mango    150.0   4.0
banana   500.0  10.0
peach   2500.0   3.0
cherry   400.0   NaN

5) qty -> QTY 수정

In [17]:
fruits2.rename(columns={'qty': 'QTY'}, inplace=True)
fruits2

         price   QTY
name
apple   2000.0   5.0
mango    150.0   4.0
banana   500.0  10.0
peach   2500.0   3.0
cherry   400.0   NaN

In [121]:
import numpy as np
import pandas as pd

names_1=['Hisila', 'Brian','Zeppy']
salary_1=[23,30,21]

names_2=['Ram','Shyam',"Hari"]
salary_2=[22,23,31]

df_1 = pd.DataFrame({'Name': names_1, 'Salary': salary_1})
df_2 = pd.DataFrame({'Name': names_2, 'Salary': salary_2})
df_1

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21

In [122]:
df_2

    Name  Salary
0    Ram      22
1  Shyam      23
2   Hari      31

In [125]:
df_1.append(df_2)

C:\Users\LG\AppData\Local\Temp\ipykernel_13908\2678984180.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_1.append(df_2)

     Name  Salary
0  Hisila      23
1   Brian      30
2   Zeppy      21
0     Ram      22
1   Shyam      23
2    Hari      31